Tiny
little
place
good
food
especially
Awesome
hole
wall
grab
quick
bite
Great
music
great
service
The
lentil
soup
steak
sandwich
absolutely
die
space
really
small
yet
cozy
This
disappointing
Ive
couple
times
couldnt
help
notice
eggplant
dip
things
menu
horrible
octopus
trust
say
worse
whole
life
portions
prices
quite
high
waitresses
nice
feel
sorry
love
greek
however
dont
think
spot
looking
pleasant
nook
less
brother
snack
neighborhood
far
comfortable
afternoon
lunch
break
choice
eat
memorable
foods
include
salad
beet
avgolemono
roasted
vegetarian
souvlaki
sandwiches
entrees
expensive
come
smaller
alright
keep
soho
expect
fair
helpful
low
key
middle
class
environment
without
normally
stars
stop
bit
Greek
slightly
lead
may
offer
falafel
true
experience
fresh
fantastic
huge
book
Lunch
combo
could
shared
amazing
try
Tuna
You
winner
eaten
Snack
always
meal
As
others
anything
lamb
delicious
location
tiny
never
wait
table
dinner
items
either
well
priced
andor
worth
stuffed
peppers
tomatoes
price
despite
tasty
atmosphere
Definitely
go
lunchtime
going
ever
since
opened
years
ago
Its
bench
outside
used
gotten
general
would
recommend
perfect
cold
lemon
chicken
orzo
tangy
spinach
triangles
flaky
dough
butter
bean
For
entree
shrimp
If
youre
shopping
Soho
iced
coffee
one
special
Otherwise
friends
squeeze
booth
bunch
particularly
fava
hummus
get
bottle
wine
serve
water
glasses
Whats
hearty
comfort
came
last
week
tea
cute
charming
waitress
surprise
Braised
Lamb
meat
literally
bone
served
sweet
rice
tzatziki
appetizer
Im
towards
fried
cheese
found
Classic
fine
line
greasy
crowded
cheap
shouldnt
matter
expectations
So
went
Unfortunately
Vegetarian
ordered
sub
par
missing
flavor
variety
vegetables
places
compared
definitely
They
told
deliver
phone
best
crazy
night
And
lemonade
become
Saturday
morning
customer
soups
pie
tuna
fan
dining
room
cramped
look
forward
back
secret
gem
My
favorite
restaurant
hands
coming
kinda
obsessed
Love
crunchy
breads
mint
summer
coworker
decide
mood
reviews
thanks
decided
must
Everything
pleasantly
pretty
kick
ass
considering
like
hard
bread
actually
ask
pita
next
time
got
Both
phenomenal
choices
Mediterranean
thick
sauces
olives
olive
oil
Needless
sister
spectacular
ready
TINY
tables
together
When
youve
people
waiting
free
makes
uncomfortable
havent
already
sure
didnt
mediterranean
dips
NYC
yum
enjoyed
To
honest
first
big
plus
seated
almost
immediately
Try
past
friend
start
texture
extra
also
traditional
dish
afterwards
forever
said
even
flavorful
day
flavored
opinion
quantity
appreciate
although
rushed
Though
seats
inside
youll
long
glad
chance
Have
coworkers
We
realize
accommodating
seating
us
Most
followed
waiters
suggestion
split
order
However
expecting
slices
style
crusty
Oh
man
thinking
enough
light
eating
thing
way
From
Literally
face
covered
creamy
broth
moment
First
begin
saying
review
yelp
Ok
tried
There
much
typical
Salad
Chicken
delivered
office
two
everyone
raving
Soup
Their
Sandwich
take
type
It
balance
goodness
In
words
complete
holding
hand
mouth
Tasting
YES
soft
wonderful
mess
cant
anymore
finish
DO
IT
close
favorites
garlic
potato
garlicky
often
werent
Between
ambiance
Id
give
five
away
hungry
end
getting
sitting
near
reason
took
star
using
spring
worst
noticed
wrong
insisted
thought
though
Then
finally
kept
trying
plates
still
done
She
orders
frequently
confused
job
correctly
lady
date
neither
seriously
year
tender
made
Ill
lots
apparently
different
Yum
wouldnt
full
suppose
ate
warm
chewy
tasted
classic
terrific
authentic
roommate
NY
homemade
basically
egg
ground
pepper
nothing
But
impressed
four
couples
seems
rave
lovely
site
call
Yelp
spent
nights
need
obviously
dates
average
simply
juice
OK
something
drink
Staff
minutes
appetizers
overpriced
relatively
find
city
hit
miss
tastes
kind
deserts
live
gave
three
list
restaurants
pick
delightful
SoHo
lucky
walked
Sunday
evening
kitchen
closed
able
group
several
parties
turned
stew
raved
Our
server
attentive
fabulous
trip
make
early
equally
Thanks
knew
pop
around
On
ones
attention
paid
selection
let
taste
every
white
personal
picked
balanced
savory
rib
tad
clear
regulars
After
brought
standard
rare
local
Well
Stopped
behind
counter
clearly
decision
placed
total
wanted
exactly
amount
pennies
He
doesnt
Who
supposed
know
accept
money
instead
course
Just
change
sit
anyway
takes
girl
says
What
employees
talk
another
mean
watch
Lovely
ciabatta
ingredients
marinated
half
block
Place
better
platter
cost
decent
Small
avoid
park
Thompson
generous
portion
braised
onions
arugula
sandwhich
artichokes
portobello
mushrooms
scallions
vinaigrette
Food
limited
wont
seat
entire
party
arrived
Fresh
refreshing
Recommend
rude
large
guy
possible
surprising
shocked
ordering
word
Cheese
That
comparison
received
cut
pieces
No
sent
almond
dessert
bag
friendly
staff
super
rich
salty
yummy
def
returning
sirloin
wish
consider
experienced
comes
chef
available
takeout
incredible
stuck
Absolutely
work
worked
juicy
sometimes
everything
else
disappoint
Friendly
filling
hours
starving
accommodate
number
called
mins
later
flavors
right
pastitsio
delicate
tart
Service
smile
mellow
consistently
fast
real
complaint
whatever
new
beans
mezze
minute
usually
someone
Also
baklava
feta
simple
roll
please
mentioned
within
thin
filled
basic
fun
nuts
extremely
maybe
business
Other
grilled
sauce
seem
complain
alot
Maybe
knows
options
area
Since
believe
Now
poor
odd
thats
asked
beer
waited
While
cleared
stay
prefer
willing
spend
minimum
understand
original
stopped
post
credit
card
Came
many
agree
bring
Once
perfection
vegetable
multiple
occasions
interior
weather
means
benches
wanting
wasnt
etc
Finally
tonight
Prices
Two
mixed
grape
leaves
pitas
beef
side
plate
greens
buy
refills
frequent
completely
ruined
manage
Tip
Theres
delivery
want
deal
Wow
hot
Delicious
clean
feels
Every
fix
awesome
beers
dishes
sooo
delish
pleasure
manager
promising
arrive
pm
Even
lost
managed
impressive
combination
platters
Roasted
spread
fishy
smoked
provided
positive
crisp
team
blown
Artichoke
included
lettuce
lack
potatoes
black
helped
slice
moist
melted
leaving
bold
satisfied
top
fell
lemony
mix
foodie
conversation
cafe
today
happy
inexpensive
guess
ppl
oh
All
probably
Did
Make
diet
soda
Not
yes
save
Was
home
charged
old
tax
pricey
moussaka
including
pricing
dark
BUT
value
suggested
giving
walking
saturday
luck
happened
window
lot
boy
strange
apartment
complex
visit
aside
name
These
culinary
girlfriend
point
south
folks
open
walk
bites
diner
mushroom
overpowering
Perhaps
bet
Really
quaint
Only
avenue
problem
freshly
sugar
drinks
Looking
casual
rated
liked
servers
felt
bland
overall
boyfriend
might
wife
weekend
heard
spots
Very
cool
Check
Alright
restroom
touch
parking
okay
YOU
DELICIOUS
making
THE
put
serious
honey
By
theyre
set
buttery
leave
nearly
along
Amazing
passed
incredibly
fish
Holy
lived
toasted
somewhat
spicy
fill
theres
taking
planning
spending
cash
sized
choose
GREAT
strong
god
hate
giant
salads
prepared
treat
One
unless
Tasty
rather
ton
travel
cucumber
late
Friday
Made
mistake
sour
pies
looked
difficult
baked
Loved
adorable
see
hadnt
changed
weeks
romantic
veal
meatballs
excellent
elegant
professional
laid
names
sampled
tons
apps
snacks
share
finished
size
major
cards
Authentic
Onion
transported
kid
family
easy
Manhattan
offers
quality
sharing
solid
seemed
slow
cherry
Each
ended
specials
ive
dollar
Overall
view
street
eater
BEST
Big
dressing
New
York
previous
days
standards
wines
refilled
Best
possibly
fit
private
red
im
apart
visiting
chose
reservation
grew
added
admit
reminded
tough
remember
school
Prince
mind
Tuesday
highlight
helping
bed
topped
downside
missed
read
warning
catch
search
squeezed
person
Anyway
held
divine
veggie
Probably
doubt
chairs
recommended
twice
door
surprised
discover
underneath
bigger
establishment
Good
picking
stuff
ok
plan
Go
stomach
veggies
artichoke
totally
fat
establishments
How
St
easily
spice
wonderfully
smelled
gets
soggy
cause
hey
Street
Why
yogurt
hidden
shop
cookies
form
East
locals
cup
apricot
syrup
almonds
toppings
meals
breakfast
healthy
single
Plus
popular
relaxed
isnt
story
owners
cuisine
youd
guys
perfectly
dine
known
wed
boss
imagine
sort
world
version
damn
pleased
reasonably
left
corner
among
least
became
shot
sat
presented
breast
baby
recently
paying
Been
Had
happen
disappointed
terms
finding
Sure
bill
Cozy
legit
Went
discovered
puree
serving
certainly
cooking
reasonable
checking
whether
feeling
taken
alone
beginning
weekly
bother
Truly
gyro
stand
upscale
homey
remembered
tomato
run
cannot
beat
nearby
Dont
Highly
forget
desserts
Excellent
pizza
pasta
cappuccino
cream
ham
YUM
crust
loved
brick
oven
Would
Will
return
margarita
pepperoni
kids
vodka
Top
joint
Do
Seriously
explain
quickly
certain
use
tasting
watery
sausage
Nothing
pretentious
plain
picky
suggest
Totally
Always
Diavola
superb
regular
needed
presentation
recommendation
prosciutto
Brooklyn
show
somewhere
round
Took
tempted
Peppinos
serves
Park
Slope
fancy
WOW
Italian
smell
playing
smells
Philly
Penne
Alla
THIS
personable
funny
comment
pastas
deserves
rough
burnt
ice
margherita
addition
Christmas
goes
honestly
complimentary
Pizza
turns
bathroom
spaghetti
italian
wheat
apologized
charge
appreciated
customers
mozzarella
non
lines
highly
pay
due
burning
wood
part
Next
loves
recession
caught
eye
knocked
At
memory
detail
specially
basil
crispy
wide
mostly
owner
young
Perfect
bruschetta
la
mine
fairly
enjoy
ignored
pizzeria
shame
check
Nice
soon
balsamic
vinegar
salt
cheesesteak
living
Keep
complaints
offered
meet
explained
liquor
ingredient
add
Thank
servings
cheaper
slope
LOVE
greeted
eclectic
decor
pizzas
seafood
melt
FANTASTIC
bad
heaven
Price
caliber
vibe
walls
range
fiance
bowl
noise
laidback
onto
floor
house
Thats
sign
packed
checked
bored
chat
option
outstanding
daughter
Brick
saw
entrance
hostess
opted
cook
Sauce
sliced
setting
Weve
South
Grimaldis
looks
cooked
pan
glass
yesterday
showed
Although
drop
moved
anywhere
Italy
slight
char
seasoned
dined
consistency
fare
patrons
trendy
reminds
tablecloths
reading
busy
bottles
bright
promptly
throughout
prompt
played
With
hype
Di
Lombardis
hold
sides
truly
diners
ricotta
crisps
flavorless
ravioli
lives
across
winter
OMG
given
forgot
month
treated
regularly
case
rating
dollars
blocks
tip
none
rarely
write
parm
joints
tastebuds
Is
front
similar
dinners
dry
bar
afraid
rush
GOOD
Pasta
Vodka
menus
Cant
Bay
notch
putting
town
Margherita
arent
months
soso
enjoyable
pass
rest
likely
affordable
waiter
arrives
appear
feed
tell
rock
al
paper
Pretty
touches
play
Ave
crowd
Please
polite
fond
welcoming
guest
SO
ambience
lacking
started
details
pictures
intimate
longer
visited
husband
second
meatball
difference
beyond
realized
bank
glorious
anyone
idea
eatery
La
plenty
six
mention
Second
AMAZING
writing
expected
hope
store
located
based
delighted
particular
alla
request
medium
weve
amazingly
thank
closer
Some
gross
issue
Village
chopped
easier
empty
exceptional
welcome
hero
piping
Solid
sad
move
correct
figured
stumbled
upon
standing
hour
base
bottom
craving
short
Too
Luckily
gone
guests
actual
surprisingly
Take
advantage
Decent
courteous
Little
plentiful
Delivery
Long
Island
efficient
center
necessary
ridiculously
tasteless
herbs
palate
gentleman
gives
beautiful
weird
goto
AND
Everyone
lets
importantly
bucks
turn
thoroughly
Ordered
stick
Like
Fantastic
perhaps
Still
head
pot
satisfying
starters
topping
wise
overly
exquisite
future
Super
train
lobster
skip
unfortunately
designed
specialty
daily
Intimate
House
Never
seen
NEVER
unpretentious
de
working
weekends
overrated
aint
annoying
Grand
welcomed
straight
Get
woman
hang
informed
ten
careful
earlier
curious
important
Last
mini
Lastly
girls
includes
picture
lukewarm
gourmet
speak
lit
Pio
watching
impress
pig
spices
overcooked
continued
onion
son
hes
raised
website
Thursday
parents
reputation
unlike
White
deep
obvious
reasons
waitstaff
normal
inviting
usual
effort
piece
Grilled
unique
address
excited
Monday
toast
favor
otherwise
beets
selections
advance
timely
fluffy
main
lower
brunch
reviewers
current
omelette
management
fully
fire
care
Fries
shortly
pudding
item
fact
suggestions
quiet
seasoning
trout
pumpkin
gnocchi
brussel
sprouts
Brunch
eggs
benedict
awhile
heart
kimchi
fries
Cafe
loud
Eggs
Benedict
interesting
hollandaise
till
third
aspects
member
sense
needs
French
frittata
hill
mimosa
questions
bought
game
Dekalb
Restaurant
communal
European
natural
bartender
answer
brings
interested
burger
mushy
Wonderful
air
cocktails
running
heavy
heavenly
His
Mark
dance
Wine
written
french
underwhelming
kale
ragu
pickled
Yes
entry
locations
lighting
dim
chill
windows
step
asking
creative
rustic
industry
ran
barely
sip
energy
decorated
justice
garden
design
daughters
snob
allergies
Atmosphere
hits
wonder
met
Sundays
cocktail
stayed
selected
hearing
banana
bacon
Decor
indeed
extensive
overbearing
blend
fork
company
knowledgable
BYOB
poorly
executed
leek
negative
wow
meeting
squash
tots
parsnip
formal
Quality
seasonal
innovative
thoughtful
partner
tapas
character
brownstone
spacious
lining
Mussels
panna
cotta
Tried
mussels
Spanish
creme
birthday
Le
Parisien
liver
described
speaking
midtown
Murray
Hill
tight
thus
wooden
Waiter
drinking
Frites
Duck
Confit
country
brulee
wings
skin
seared
gorgeous
chefs
roast
floating
salted
Perfection
rate
duck
Such
groups
poached
salmon
florentine
frites
apple
compote
bistro
du
confit
tatin
famous
Steak
Lets
sea
booked
eventually
cover
Having
proceeded
attitude
double
reservations
host
goat
pork
island
endive
walnut
risotto
saffron
orange
Wish
profiteroles
chocolate
Saw
NOT
Got
OJ
sangria
Mimosa
escargots
Paris
Parisian
wild
Apple
desert
vanilla
mediocre
bistros
continue
Carpaccio
France
Started
escargot
patient
except
relax
Poached
Salmon
Gravlax
Sangria
champagne
blue
occasion
bags
deserve
English
ALL
Escargot
Dinner
Entrees
hubby
candles
paired
hear
skate
American
refused
removed
moderately
charm
Come
mashed
prix
fixe
green
terrible
tartar
celebrate
anniversary
moules
mussel
engagement
Cute
ahead
croque
tartare
tarte
courses
shell
pate
fruit
Hollandaise
bananas
cod
apples
Rhone
married
Floating
custard
agreed
Happy
textures
gift
deliciously
note
vintage
posters
additional
knowledgeable
Coffee
lovers
monsieur
chorizo
overwhelming
luckily
Let
returned
During
City
app
tenderloin
opportunity
pear
Your
Midtown
Thai
filet
mignon
carpaccio
Parisienne
noisy
truffle
convenient
prefix
coat
meats
Day
per
pairing
Mushroom
approach
impression
raw
flawless
blow
stuffy
Of
wrapped
caramelized
parts
began
online
grabbed
movie
beautifully
worthy
tourists
Appetizers
absolute
Creme
yellow
wifes
sweetness
budget
latte
gluten
mimosas
loaf
constantly
celebration
bass
con
mother
mild
adds
bringing
steal
board
experiences
send
arrival
nyc
espresso
Kitchen
omelet
genuine
nicely
women
accommodated
dirty
unusual
larger
An
forgotten
hanging
Be
Sorry
requested
dinning
Theyve
prepare
AT
watched
stated
Chef
visits
bc
preparation
burgers
works
Nai
dismissive
talking
flamenco
downstairs
mango
delight
Flamenco
shows
ink
croquettes
David
Tapas
spanish
bridal
sick
hoping
Nook
greeting
rosemary
cigars
sushi
doors
Again
chops
Theyre
Hells
pancakes
handle
entered
Burger
regret
rotisserie
event
plantains
plantain
Hands
Hunters
truck
Halal
trucks
cart
kefta
wrap
falafels
samples
PS
Vendy
Freddy
King
Falafel
Shawarma
king
halal
shawarma
Astoria
Broadway
wedding
describe
carts
kebab
Turkish
hat
Better
stools
oysters
watering
cake
Bouley
basement
level
upstairs
Mr
sommelier
porcini
flan
crab
celebrated
tongue
Toro
flowers
Sea
aroma
unprofessional
amuse
Porcini
Flan
Japanese
souffle
Before
impeccable
unbelievable
organic
bouche
inventive
hotel
sorbet
Cici
doggie
Danny
Meyer
opening
Puerto
Adela
venue
Maialino
deleted
hr
squid
Week
MIN
di
hospitality
PASTA
Union
Roman
cacio
pepe
Gramercy
carbonara
maialino
suckling
Carbonara
Shower
Palo
Santo
shower
buffet
avocado
tortillas
mole
Gonzalo
Bridal
soba
Retro
Uncle
Gussys
Crisp
CRISP
Ian
substitute
und
dass
Gericht
das
des
dem
Familie
als
der
zu
nicht
wurde
mit
es
war